-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Nov 11, 2024 at 05:03 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `employee`
--

-- --------------------------------------------------------

--
-- Table structure for table `employeedetail`
--

CREATE TABLE `employeedetail` (
  `ID` int(11) NOT NULL,
  `EmpFname` varchar(50) DEFAULT NULL,
  `EmpLName` varchar(50) NOT NULL,
  `EmpCode` varchar(50) DEFAULT NULL,
  `EmpDept` varchar(120) DEFAULT NULL,
  `EmpDesignation` varchar(120) DEFAULT NULL,
  `EmpContactNo` bigint(10) DEFAULT NULL,
  `EmpGender` enum('Male','Female') DEFAULT NULL,
  `EmpEmail` varchar(200) DEFAULT NULL,
  `EmpPassword` varchar(100) DEFAULT NULL,
  `EmpJoingdate` date DEFAULT NULL,
  `PostingDate` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `employeedetail`
--

INSERT INTO `employeedetail` (`ID`, `EmpFname`, `EmpLName`, `EmpCode`, `EmpDept`, `EmpDesignation`, `EmpContactNo`, `EmpGender`, `EmpEmail`, `EmpPassword`, `EmpJoingdate`, `PostingDate`) VALUES
(1, 'Ahmed', 'Ahmad', '123465', 'IT', 'Software Developer', 825099421, 'Male', 'abc@gmail.com', 'Test@12345', '2024-10-29', '2024-11-06 03:31:49'),
(2, 'kawla', 'Kumar', '123465558', 'CS', 'Software Developer', 825099421, 'Female', 'anuj@gmail.com', '123', '2024-10-23', '2024-11-06 03:31:49'),
(3, 'Amena', 'shiekh', '123467', 'IT', 'Software Developer', 825099421, 'Male', 'ankush@gmail.com', '89756', '2024-09-13', '2024-11-06 03:31:49'),
(4, 'مريم', 'الخالد', '12346012', 'IT', 'Software Developer', 825099421, 'Female', 'abhi@gmail.com', '156975', '2024-11-10', '2019-02-06 03:42:47'),
(6, 'أحمد', 'جمال', '369874', '', '', 0, 'Female', 'manu@gmail.com', '987563', '2024-11-03', '2019-02-06 09:00:50'),
(7, 'mohamad', 'shiekh', '63', NULL, NULL, NULL, NULL, 'shahye@gmail.com', '99999', '2024-11-07', '2019-02-08 04:22:40'),
(9, 'shiekh', 'almostafa', '89745', '', '', 0, 'Female', 'jk@gmail.com', '12', '2024-11-05', '2019-02-11 02:12:28'),
(10, 'Khusi', 'kjsjkash', '1234', '', '', 0, 'Male', 'hjk@gmail.com', '1990', '2024-11-05', '2019-02-11 02:18:08'),
(13, 'Test', 'User', '2131231', 'IT', 'Software Developer', 1234567890, 'Male', 'testuser@gmail.com', 'Test@123', '2024-10-31', '2019-02-11 13:21:58'),
(18, 'أبو عبيدة', 'الشيخ', '555447', '', '', 0, 'Male', 'abdalstaralshek777@gmail.com', '5555', '0000-00-00', '2024-11-10 10:44:07'),
(20, 'عبد الله', 'الخالد', '6465', NULL, NULL, NULL, NULL, 'abd@gmail.com', '555', NULL, '2024-11-10 16:30:57');

-- --------------------------------------------------------

--
-- Table structure for table `sermon`
--

CREATE TABLE `sermon` (
  `ID` int(11) NOT NULL,
  `title` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_croatian_ci DEFAULT NULL,
  `sermon` varchar(7000) CHARACTER SET utf8mb4 COLLATE utf8mb4_croatian_ci DEFAULT NULL,
  `sermonRegdate` timestamp NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COLLATE=latin1_swedish_ci;

--
-- Dumping data for table `sermon`
--

INSERT INTO `sermon` (`ID`, `title`, `sermon`, `sermonRegdate`) VALUES
(34, 'التوبة - مقدمة (1)', 'مقدمة الخطبة:\r\n السلام عليكم ورحمة الله وبركاته، الحمدلله الذي هدانا للإسلام وكفى بها من نعمة، ومنّ علينا بالتوبة والغفران، إنه هو غافر الذنب، وقابل التوب، شديد العقاب، والصلاة والسلام على من بعثه الله -تعالى- هاديًا للإسلام مبشرًا ونذيراً، أشرف الخلق -عليه الصلاة والسلام-، أمّا بعد.[١][٢]\r\n', '2024-11-10 19:41:07'),
(35, 'التوبة - الوصية بتقوى الله (2)', 'الوصية بتقوى الله:\r\nعباد الله، أوصيكم بتقوى الله، وهي الوصية التي وجهها الله -سبحانه وتعالى- للأولين والآخرين، ولتعلموا بأنّ تقوى الله؛ تعني أن يعمل العبد بطاعة الله، ويكون على نورٍ من ربه -عز وجل-، يرجو الثواب من الله وحده، ويترك المعاصي التي تُغضب الله، وكذلك على نور من الله، خائفًا من عقاب الله، وتقوى الله تكون بطاعته جلّ وعلا واجتناب نواهيه، وقد أوصى الله -سبحانه وتعالى- في كتابه الكريم بالتقوى فقال: (وَلَقَدْ وَصَّيْنَا الَّذِينَ أُوتُوا الْكِتَابَ مِن قَبْلِكُمْ وَإِيَّاكُمْ أَنِ اتَّقُوا اللَّـهَ).[٣][٤]', '2024-11-10 19:42:58'),
(36, 'التوبة - الخطبة الأولى(3)', 'الخطبة الأولى:\r\nبسم الله، والحمد لله غافر الذنب، وقابل التوب شديد العقاب، وأشهد أنّ لا إله إلا الله، وأشهد أنّ سيدنا محمد عبده ورسوله، أما بعد: أحبتي الكرام، قال الإمام ابن القيم -رحمه الله-: \"أكثر الناس لا يعرفون قدر التوبة، ولا حقيقتها فضلا عن القيام بها، علماً وعملاً وحالاً، مع أنّ التوبة هى حقيقة دين الإسلام، والدين كله داخل في مسمى التوبة، من أجل ذلك استحق التائب أن يكون حبيب الرحمن -جل وعلا-، فأصل التوبة فى اللغة الرجوع يقال: تاب وآب وثاب بمعنى رجع، فالتائب إلى الله هو الراجع عن كل ما يكرهه الله ظاهراً وباطناً، إلى كل ما يحبه الله ظاهراً وباطنا\". يا عباد الله، أوصيكم بالتوبة إلى الله، فقد كان رسولنا الكريم -صلى الله عليه وسلم- يوصينا بالتوبة و الاستغفار، وورد ذلك في حديثه الشريف: (يَا أَيُّهَا النَّاسُ تُوبُوا إلى اللهِ، فإنِّي أَتُوبُ في اليَومِ إلَيْهِ مِئَةَ مَرَّةٍ)،[٥] أيها الإخوة الكرام، إنّ التوبة صحة للقلوب، فمرض القلوب لا يكون إلا بسبب الذنوب، وما أجمل التوبة، فهي الأمل الدائم بالله، والرجاء الذي لا ينقطع، فالله -عز وجل- الغفور الرحيم دائماً بانتظار عباده التوابين، (فَقُلْتُ اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كَانَ غَفَّارًا* يُرْسِلِ السَّمَاءَ عَلَيْكُم مِّدْرَارًا* وَيُمْدِدْكُم بِأَمْوَالٍ وَبَنِينَ وَيَجْعَل لَّكُمْ جَنَّاتٍ وَيَجْعَل لَّكُمْ أَنْهَارًا). ولا بدّ لنا يا إخوتي من الوقوف بين يديّ الله، فكلّنا مذنبون ومقصرون بحق الله، فلنقف أمامه منكسرين القلب، وخاشعين بجوارحنا ولسان حالنا يقول: يا رب ليس لنا أحد سواك يتوب علينا ويغفر لنا ذنوبنا، يا رب ليس لنا رب سواك يقبل توبتنا ويرحمنا، يا رب ارحمنا برحمتكِ يا أرحم الراحمين.[٦] فتوبوا إلى الله -تعالى- توبةً نصوحًا، فما هي التوبة النصوحة؟ إنها التوبة الصادقة الخالصة لله -تعالى- وحده لا شريك له، وهنيئًا لمن تاب لربه توبةً حقيقيةً، فالله -عز جلاله- وعد عباده التائبين (يَا أَيُّهَا الَّذِينَ آمَنُوا تُوبُوا إِلَى اللَّـهِ تَوْبَةً نَّصُوحًا عَسَى رَبُّكُمْ أَن يُكَفِّرَ عَنكُمْ سَيِّئَاتِكُمْ وَيُدْخِلَكُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ)،[٧] وهذه التوبة لا تتحقق إلا بثلاثة شروط؛ أولها ترك الذنب الذي تُبت إلى الله منه، والاستغفار الدائم عليه، فمن استغفر وهو ما زال على ذنبه فلن يقبل الله منه توبته، وثاني شروط التوبة عقد النية التامة والعزم على عدم العودة لهذا الذنب مرةً أخرى، وثالث الشروط هو الندم على ما اقترفه من ذنوبٍ وخطايا، والخجل من الله -سبحانه وتعالى-، فالندم أهم من الاستغفار ولا يقبل الله الاستغفار من عبد يجهر بذنبه ولا يستحي منه أمام الله.[٨] والتوبة ليست سِوى امتثالًا لأوامر الله -جلّ وعلا-، قوله -تعالى-: (وَتُوبُوا إِلَى اللَّـهِ جَمِيعًا أَيُّهَ الْمُؤْمِنُونَ لَعَلَّكُمْ تُفْلِحُونَ)،[٩] فالتوبة لله تكون؛ لأننا يوم القيامة نمثل أمام الله -تعالى- للحساب، فتوضع سيئاتنا وحسناتنا في كفتين، ولن ترجح كفة الحسنات إلا بالتوبة النصوحة التي يُكفّر بها ذنوبنا، وممّا لا شك فيه يا إخوتي بأنّ التوبة سبب في نيل محبة الله، فهو -سبحانه وتعالى- يُحبّ التوابين، والأوابين، والمستغفرين، ونتوب لله حتى نُغيظ الشيطان، ونُخزي الأعداء، ونُبيّض صحيفتنا يوم القيامة، فالتوبة النصوح ترفع درجاتنا، وتعلّي قدرنا، وتُوسّع قبورنا. ولتعلموا أنّ باب التوبة إلى الله مفتوح لكلّ التائبين، فهو الذي يبسط يده في الليل لِيتوب مسيء النهار، ويبسط يده في النهار لِيتوب مسيء الليل، فأبواب التوبة لا تُغلق أبداً، والمؤمن لا يقنط من رحمة الله، فهو الغفور الرحيم الذي يتوب على عباده كلما عادوا إليه تائبين، وقد ذكر ذلك في كتابه الكريم بقوله: (قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَى أَنفُسِهِمْ لَا تَقْنَطُوا مِن رَّحْمَةِ اللَّـهِ إِنَّ اللَّـهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ)،[١٠] وفي الآية الأخرى التي وعد الله بها عباده بأن يغفر ذنوبهم: (وَمَن يَعْمَلْ سُوءًا أَوْ يَظْلِمْ نَفْسَهُ ثُمَّ يَسْتَغْفِرِ اللَّـهَ يَجِدِ اللَّـهَ غَفُورًا رَّحِيمًا).[١١] وأفضل أمرنا هو استشعار مراقبة الله -تعالى- لنا، والاعتراف بذنوبنا، تعالوا نُنير قلوبنا بالعودة إلى الله، والتوبة إليه، وتجنب الذنوب، وإن وقعت، فلنبادر بالتوبة النصوح إلى الله -تعالى-، فهي سبب للسعادة والخير، وبها يحفظ الله -تعالى- للعبد أعماله الصالحة، ويُكفّر عنه المعاصي التي اقترفها، ويدفع عنه العقوبات النازلة والآتية، فالتوبة من أعظم الأبواب التي منحها الله تعالى لنا لِيمنحنا الحسنات الكثيرة، ومن أعظم العبادات التي يُحبّها الله -تعالى- ويفرح بها.[١٢][٦] أيها الناس، ولعلّ أكثر ما يجذبنا في قصص التوبة قصة سيدنا آدم الذي عصا ربه في الجنة، وأطاع الشيطان الذي وسوس له ولزوجته حواء ليأكلّا من الشجرة التي أمرهما الله بالابتعاد عنها، إلا إنّهما يا إخوتي ندما على ذنبهما وظلّا يبكيان حزنًا وندمًا على ما فعلاه، وبقيّا يطلبان من الله العفو، و المغفرة، إلى أن تاب الله عليهما وتجاوز عن خطئهما بسبب توبتهما النصوحة الصادقة. ولا أحد منّا يا إخوتي لا يعرف قصة الثلاثة الذين تخلفوا عن غزوة تبوك؛ وهم كعب بن مالك، وهلال بن أمية، ومُرارة بن الربيع، إذ دعا رسول -صلى الله عليه وسلم- المسلمين إلى الاستعداد للحرب، إلا أنّ كعب ورفاقه تخلّفوا عن المسير مع رسول الله دون عُذر، فما كان من رسول الله إلا أن جعل أمره وأصحابه بيد الله، وضاقت عليهم الأرض بما رحبت حين قاطعهم الناس، وشعروا بالحزن إلى أن نزلت فيهم الآيات الكريمة في سورة التوبة التي تُبيّن قبول الله -تعالى- لِتوبتهم، ورضاه عنهم.[١٣] ودعوني أذكركم إخوتي بقصة الرجل الذي قتل تسعاً وتسعين نفسًا، وأراد التوبة إلى الله -تعالى-، فسار بحثاً عن عالِمٍ يسأله كيف يتوب إلى الله، فدلّه الناس على راهب، وحين وصل إليه وسأله هل تُقبل توبتي إلى الله بعد ما فعلت؟، فأجابه الراهب بأنّه لا توبة له، فاغتاظ الرجل من الراهب وقتله مُكمّلًا عدد من قتلهم على مئة نفس، وسار بحثًا عن عالمٍ آخر يسأله عن التوبة حتى وصل إلى رجلٍ ذو علم فسأله عن حاله، وهل له من توبة؟ فقال له العالم: \"وما الذي يحول بينك وبين التوبة إلى الله؟\"، وأرشده إلى بلاد لِيعيش بها مع أناس يعبدون الله ويتقونه، وحين سار هذا الرجل لهذه البلاد وافته المنية وجاءت ملائكة الرحمة وملائكة العذاب لِيعرفون أين سجله، فملائكة العذاب تقول بإنّه لم يفعل خيرًا قط، وملائكة الرحمة تقول إنّه جاء لله تائبًا، فأرسل الله -سبحانه وتعالى- إليهم ملّكًا على هيئة إنسان لِيحكم بينهم، وأمرهم بقياس المسافة بين بلدته التي خرج منها والبلد التي كان متجهًا إليها لِعبادة الله، فكان الرجل أقرب للبلدة الصالحة التي كان متجهًا إليها، وبهذا فقد أخذته ملائكة الرحمة، فقد تاب الله عليه، فلا تيئسوا إخوتي من رحمة الله وتوبوا إليه مهما بلغت ذنوبكم، فالله هو الغفور الرحيم.[١٣] أقول قولي هذا وأستغفر الله لي ولكم.', '2024-11-10 19:46:42'),
(37, 'التوبة - الخطبة الثانية (4)', ' الخطبة الثانية:\r\n الحمدلله الذي نحمده بآلائه، ونمدحه على نعمائه، ونشكره على جزيل عطاءه، والذي نستعطفه من حلول بلائه، الحمدلله كاشف الكرب، وقابل التوب، الله الذي يُنعم على المعتذر بكريم صفحه، والذي يُثيب المناجي على ثنائه ومدحه، أما بعد:[١٤] عباد الله، فلتعلموا أنّه لا بدّ من الإخلاص التام لله -تعالى- في التوبة؛ بأن يكون السبب الرئيسي للتوبة حب الله وتعظيمه ورجاؤه، وخوفًا من عقابه، وطمعًا في ثوابه، لا أن تكون من أجل التقرّب من مخلوق، أو لِقصدٍ من مقاصد الدنيا الزائلة، ومن أخلص لله يُعينه الله ويمدّه بالقوة ويصرف عنه الذنوب والخطايا، والأمر الذي لا شك فيه بأنّ الله -سبحانه وتعالى- لا يقبل التوبة بعد ظهور علامات الساعة الكبرى وأولها ظهور الشمس من مغربها، فلنسارع إخوتي بالرجوع إلى الله -تعالى- والتوبة له توبةً نصوحًا، فما زال باب التوبة مفتوحاً.[١٥] والتوبة تمحي ما كان قبلها، فلا يلتفت الإنسان إلى ما كان منه من ذنب وتقصير، فمن تاب إلى الله وآمن وعمل صالحًا فإنّ الله يُبدل سيئاته حسنات، ويبشره بمغفرة وأعلى الدرجات.[١٦]\r\n\r\n', '2024-11-10 19:49:27');

-- --------------------------------------------------------

--
-- Table structure for table `tbladmin`
--

CREATE TABLE `tbladmin` (
  `ID` int(11) NOT NULL,
  `AdminName` varchar(50) DEFAULT NULL,
  `AdminuserName` varchar(50) DEFAULT NULL,
  `Password` varchar(45) DEFAULT NULL,
  `AdminRegdate` timestamp NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `tbladmin`
--

INSERT INTO `tbladmin` (`ID`, `AdminName`, `AdminuserName`, `Password`, `AdminRegdate`) VALUES
(1, 'Abdulsattar', '155521', '555447', '2024-02-07 13:52:45'),
(2, 'AboObaida', 'M01512', '123', '2024-11-05 08:16:06');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `employeedetail`
--
ALTER TABLE `employeedetail`
  ADD PRIMARY KEY (`ID`),
  ADD UNIQUE KEY `EmpCode` (`EmpCode`);

--
-- Indexes for table `sermon`
--
ALTER TABLE `sermon`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `tbladmin`
--
ALTER TABLE `tbladmin`
  ADD PRIMARY KEY (`ID`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `employeedetail`
--
ALTER TABLE `employeedetail`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT for table `sermon`
--
ALTER TABLE `sermon`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=39;

--
-- AUTO_INCREMENT for table `tbladmin`
--
ALTER TABLE `tbladmin`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
